# SQL Workshop
### <font color=indigo>LIVE DEMOs</font>
---

* This document is a technical brainstorm (like whiteboarding with code). 
* I'll give you this and any other assets over the break. 
* No need to follow along live.

---

## Introductions

* Name
* Background/Role
* Prior Experience with SQL?
* Hobby

### Michael Burgess
* michael.burgess@decoded.com

* Head of Technical Solutions
    * Head for Data, Analytics, AI
    * IT contractor defence, telephony, mobile, ...
    * Physics 6/7yr
* Arguing, Youtube, Podcasts, Philosophy

### The Group

* Rachel
    * Quality & Compliance, Sales, MOD
        * no prior experience, but made much more sense than python
    * Walking & Singing 
    
* Tim
    * Data Transformation team, as Data Literacy Manager
        * up-skill people with data, self-serve content
        * sports & retail
    * Some prior experience reading, loose understanding
    * runner, cycling

* Richard 
    * Life-cycle management engineer
    * Vodafone 20yr, MOD
        * no prior SQL, but some databases
    * Runner

---


## SQLite & Python

A library is built-into python which provides util for sqlite; this is specific to sqlite3.

In [11]:
import sqlite3

The sqlalchemy library can connect to and manage multiple different `RDBMS`es...

In [12]:
from sqlalchemy import create_engine

Set up and (in this case *create*) the databse,

In [13]:
db = create_engine("sqlite:///demo.db")

Get a connetion which we can use *as if it were a file*,

In [14]:
con = db.connect()

... this means that sometimes when i could use a file connection, i can instead use this one..

## Using Pandas with SQL

In [15]:
import pandas as pd

Pandas can save to *files* and therefore also dbs,

In [16]:
prices = pd.DataFrame({
    'Name': ['Alice', 'Eve', 'Bob'],
    'Price': [10, 20, 30]
})

prices

    Name  Price
0  Alice     10
1    Eve     20
2    Bob     30

The number of rows *saved* to the table `prices` is...

In [17]:
# prices.to_sql('prices', con)

In [18]:
prices.to_sql('prices', con, index=False, if_exists='replace')

3

In [19]:
pd.read_sql('SELECT * FROM prices', con)

    Name  Price
0  Alice     10
1    Eve     20
2    Bob     30

### A Querying Template

It's convenient to use a document string when specifying a query, so we can use whitespace,

In [20]:
# document string

query = """
    SELECT *
        FROM prices
"""

pd.read_sql(query, con)

    Name  Price
0  Alice     10
1    Eve     20
2    Bob     30

### Q&A

* How would I select just the `Name` column?

In [21]:
query = """
    SELECT Name
        FROM prices
"""

pd.read_sql(query, con)

    Name
0  Alice
1    Eve
2    Bob

* How would I select `prices` equal to or over $£20$,

In [22]:
query = """
    SELECT *
        FROM prices
        WHERE 
            Price >= 20
"""

pd.read_sql(query, con)

  Name  Price
0  Eve     20
1  Bob     30

* How would I select `prices` equal to or over $£20$, **but just one row**

In [23]:
query = """
    SELECT *
        FROM prices
        WHERE 
            Price >= 20
        LIMIT 1
"""

pd.read_sql(query, con)

  Name  Price
0  Eve     20

...which row is (sort of) random right now... how would we make this a minimum?

# BREAK

---
## Activity: Workbook I
---

## Review Activity I: Filtering

## JOINs

---
## Activity: Workbook 2
---

## Review Activity II: Linking Tables

## Sub-Queries

---
## Activity: Workbook 3
---